cf_billing/Catalogs/энргМаршрутыКонтроллеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргМаршрутыКонтроллеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.энргСотрудники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АдресаМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КлючПомещений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргКлючиПомещенийМаршрутовКонтролеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещенийМаршрутовКонтролеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>МаршрутКонтролера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргМаршрутыКонтроллеров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные маршрута по ключу помещения.
//
// Параметры:
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
// 
// Возвращаемое значение:
//   Структура:
//    * Маршрут		-	СправочникСсылка.энргМаршрутыКонтроллеров.
//    * Контролер	-	СправочникСсылка.энргСотрудники.
//
Функция  ДанныеМаршрутаПоКлючуПомещения(КлючПомещения) Экспорт 
	
	Результат  			= Новый Структура("Маршрут,Контролер", Справочники.энргМаршрутыКонтроллеров.ПустаяСсылка(), Справочники.энргСотрудники.ПустаяСсылка());
	Запрос  			= Новый Запрос(ТекстЗапросаДанныеМаршрутаПоКлючуПомещения());
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	РезультатЗапроса 	= Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка  		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Формирует текст запроса для получение состава маршрута.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СоставМаршрута(Схема,ТаблицаДляПомещения ="") Экспорт 
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргМаршрутыКонтроллеровАдресаМаршрута.Представление КАК Представление
	|ИЗ
	|	Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	|ГДЕ
	|	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка = &МаршрутКонтроллера";
	
	Пакет  						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;	
		
КонецПроцедуры

// Формирует текст запроса для получение маршрута по ключу помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбор		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТекстМаршрутПоКлючуПомещения(Схема,ПараметрыОтбор,ТаблицаДляПомещения ="") Экспорт 
	
	ВызватьИсключение "Метод не реализован";	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеМаршрутаПоКлючуПомещения()
	
	Текст =
	"ВЫБРАТЬ
	|	энргКлючиПомещенийМаршрутовКонтролеров.МаршрутКонтролера КАК Маршрут,
	|	энргКлючиПомещенийМаршрутовКонтролеров.МаршрутКонтролера.Владелец КАК Контролер
	|ИЗ
	|	РегистрСведений.энргКлючиПомещенийМаршрутовКонтролеров КАК энргКлючиПомещенийМаршрутовКонтролеров
	|ГДЕ
	|	энргКлючиПомещенийМаршрутовКонтролеров.КлючПомещения = &КлючПомещения";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
